---
kind: enumMember
id: F:Autodesk.Revit.DB.ExportColorMode.IndexColors
enum: Autodesk.Revit.DB.ExportColorMode
source: html/20b1158b-d5ab-057d-d780-a4870d0c2a5b.htm
---
# Autodesk.Revit.DB.ExportColorMode.IndexColors

All colors from the Revit project will be set to the closest of the 255 AutoCAD Color Index colors.